#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции
Функция ВыполнитьСерверныйКод(Период) Экспорт    
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор КАК Договор,
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Клиент КАК Клиент,
		|	СУММА(ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот) КАК СуммаКОплатеОборот,
		|	&Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВыполненоРабот
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор,
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Клиент
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Договор,
		|	Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВКМ_ПродажиПоАктамОбороты.СуммаОборот) КАК СуммаОборот,
		|	ВКМ_ПродажиПоАктамОбороты.Номенклатура КАК Номенклатура,
		|	ВКМ_ПродажиПоАктамОбороты.Контрагент КАК Контрагент,
		|	ВКМ_ПродажиПоАктамОбороты.Договор КАК Договор
		|ПОМЕСТИТЬ втАкты
		|ИЗ
		|	РегистрНакопления.ВКМ_ПродажиПоАктам.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			(Контрагент, Договор) В
		|					(ВЫБРАТЬ
		|						Работы.Клиент,
		|						Работы.Договор
		|					ИЗ
		|						ВыполненоРабот КАК Работы)
		|				И Номенклатура = &Номенклатура) КАК ВКМ_ПродажиПоАктамОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ПродажиПоАктамОбороты.Номенклатура,
		|	ВКМ_ПродажиПоАктамОбороты.Контрагент,
		|	ВКМ_ПродажиПоАктамОбороты.Договор
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Контрагент,
		|	Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбработкаЗаказовОбороты.Контрагент КАК Контрагент,
		|	ОбработкаЗаказовОбороты.Договор КАК Договор,
		|	ОбработкаЗаказовОбороты.Заказ КАК Заказ
		|ПОМЕСТИТЬ втЗакзы
		|ИЗ
		|	РегистрНакопления.ОбработкаЗаказов.Обороты(
		|			ДОБАВИТЬКДАТЕ(&НачалоПериода, МЕСЯЦ, -12),
		|			&КонецПериода,
		|			,
		|			(Контрагент, Договор) В
		|				(ВЫБРАТЬ
		|					Работы.Клиент,
		|					Работы.Договор
		|				ИЗ
		|					ВыполненоРабот КАК Работы)) КАК ОбработкаЗаказовОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ОбработкаЗаказовОбороты.Контрагент КАК Контрагент,
		|			ОбработкаЗаказовОбороты.Договор КАК Договор,
		|			МАКСИМУМ(ОбработкаЗаказовОбороты.Заказ.Дата) КАК ЗаказДата
		|		ИЗ
		|			РегистрНакопления.ОбработкаЗаказов.Обороты(
		|					ДОБАВИТЬКДАТЕ(&НачалоПериода, МЕСЯЦ, -12),
		|					&КонецПериода,
		|					,
		|					(Контрагент, Договор) В
		|						(ВЫБРАТЬ
		|							Работы.Клиент,
		|							Работы.Договор
		|						ИЗ
		|							ВыполненоРабот КАК Работы)) КАК ОбработкаЗаказовОбороты
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ОбработкаЗаказовОбороты.Контрагент,
		|			ОбработкаЗаказовОбороты.Договор) КАК МаксимСроки
		|		ПО ОбработкаЗаказовОбороты.Контрагент = МаксимСроки.Контрагент
		|			И ОбработкаЗаказовОбороты.Договор = МаксимСроки.Договор
		|			И ОбработкаЗаказовОбороты.Заказ.Дата = МаксимСроки.ЗаказДата
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Контрагент,
		|	Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыполненоРабот.Договор КАК Договор,
		|	ВыполненоРабот.Клиент КАК Клиент,
		|	ВыполненоРабот.СуммаКОплатеОборот - ЕСТЬNULL(втАкты.СуммаОборот, 0) КАК СуммаКОплате,
		|	ЕСТЬNULL(втАкты.Номенклатура, ВыполненоРабот.Номенклатура) КАК Номенклатура,
		|	втЗакзы.Заказ КАК Заказ
		|ИЗ
		|	ВыполненоРабот КАК ВыполненоРабот
		|		ЛЕВОЕ СОЕДИНЕНИЕ втАкты КАК втАкты
		|		ПО ВыполненоРабот.Клиент = втАкты.Контрагент
		|			И ВыполненоРабот.Договор = втАкты.Договор
		|		ЛЕВОЕ СОЕДИНЕНИЕ втЗакзы КАК втЗакзы
		|		ПО ВыполненоРабот.Клиент = втЗакзы.Контрагент
		|			И ВыполненоРабот.Договор = втЗакзы.Договор
		|ГДЕ
		|	ВыполненоРабот.СуммаКОплатеОборот - ЕСТЬNULL(втАкты.СуммаОборот, 0) > 0";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Период));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("Номенклатура", Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	КоличествоРеализация = Выборка.Количество();     
	Счетчик=0; 
	Результат = "";
	Пока Выборка.Следующий() Цикл  
		Счетчик = Счетчик+1;           
		
		НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		НовыйДокумент.Дата = КонецМесяца(Период);
		НовыйДокумент.Контрагент = Выборка.Клиент;
		НовыйДокумент.Договор = Выборка.Договор;
		НовыйДокумент.Комментарий = СтрШаблон("Создано обработкой в %1",ТекущаяДатаСеанса());   
		НовыйДокумент.Организация = Константы.ВКМ_ОсновнаяОрганизация.Получить();    
		НовыйДокумент.Основание = Выборка.Заказ;    
		НовыйДокумент.СуммаДокумента = Выборка.СуммаКОплате;     
		//@skip-check undefined-variable
		НовыйДокумент.Ответственный = Пользователи.ТекущийПользователь();
		НовыйДокумент.ВыполнитьАвтозаполнение();
		
		Если НовыйДокумент.ПроверитьЗаполнение() Тогда
		    НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение); 
			Результат = Результат + СтрШаблон("Создан документ %3 для контрагента %1 по договору %2",
							Выборка.Клиент, Выборка.Договор, НовыйДокумент)+ "
							|";
		КонецЕсли; 
		
		//@skip-check undefined-variable
		ДлительныеОперации.СообщитьПрогресс(Счетчик / КоличествоРеализация * 100);
	КонецЦикла;
	

	Возврат Результат;
	
КонецФункции	
# КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
