 
#Область ПрограммныйИнтерфейс 
// Расчет удержаний по всем начислениям
// Параметры:
//   НаборЗаписейУдержание -РегистрРасчетаНаборЗаписей.ВКМ_Удержания- Записи регистра Удержания.
//   НаборЗаписейВыплаты -РегистрНакопленияНаборЗаписей.ВКМ_ВзаиморасчетыССотрудниками- Записи регистра Выплаты.
//   НазваниеРегистра -Строка - Название регистра, из которого необходимо взять данные.
//   Ссылка - ДокументССылка - Документ для расчета.
//   ДатаЗаписи - Дата - Дата созания записи.
// Возвращаемое значение:
// ТаблицаЗначений - таблица с удержаниями.
Функция РассчитатьУдержание(НаборЗаписейУдержание, НаборЗаписейВыплаты, НазваниеРегистра, Ссылка, ДатаЗаписи) Экспорт   
	НаборЗаписейВыплаты.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	&Период КАК ПериодРегистрации,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник,
		|	&ВидРасчета КАК ВидРасчета,
		|	СУММА(ВКМ_ОсновныеНачисленияДанныеГрафика.Результат) / 100 * 13 КАК Результат
		|ИЗ
		|	РегистрРасчета."+НазваниеРегистра+" КАК ВКМ_ОсновныеНачисленияДанныеГрафика
		|ГДЕ
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.Регистратор = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник";
	
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_Удержания.НДФЛ);
	Запрос.УстановитьПараметр("Период", ДатаЗаписи);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	НаборЗаписейУдержание.Записывать = Истина;
	Пока Выборка.Следующий() Цикл    
		Движение = НаборЗаписейУдержание.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);     
		
		ЗаписьПоВыплатам(НаборЗаписейВыплаты, Ложь, ДатаЗаписи, Выборка.Сотрудник, Выборка.Результат);		
		
	КонецЦикла;                                     
	
	НаборЗаписейУдержание.Записать();
	НаборЗаписейВыплаты.Записать();
	
	
   Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	      

// Формирование записи по выплатам в регистре
// Параметры:
//   НаборЗаписейВыплаты -РегистрНакопленияНаборЗаписей.ВКМ_ВзаиморасчетыССотрудниками- Записи регистра Выплаты.
//   Приход -Булево- Вид записи в регистр.
//   Дата -Дата- Дата формирования записи.
//   Сотрудник -СправочникСсылка.Пользователи- Сотрудник по которому формируется запись.
//   Сумма -Число- Сумма на которую формируется запись.
Процедура ЗаписьПоВыплатам(НаборЗаписейВыплаты, Приход, Дата, Сотрудник, Сумма) Экспорт    
	
	Если Приход Тогда
		ДвижениеПоВыплатам = НаборЗаписейВыплаты.ДобавитьПриход();
	Иначе
		ДвижениеПоВыплатам = НаборЗаписейВыплаты.ДобавитьРасход();
	КонецЕсли;	

	ДвижениеПоВыплатам.Период = Дата;
	ДвижениеПоВыплатам.Сотрудник = Сотрудник;
	ДвижениеПоВыплатам.Сумма = Сумма;

КонецПроцедуры	
# КонецОбласти