#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Данные = ПолучитьИзВременногоХранилища(Параметры.АдресВХ);
	
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();

	Для Каждого Строка Из Данные.ГрафикОтпусков Цикл
	    // Определение точки (строки) и серии (цветного интервала)
	    ТекущаяТочка = Диаграмма.УстановитьТочку(Строка.Сотрудник); 
		ТекущаяТочка.Текст = Строка.Сотрудник;
	    ТекущаяСерия = Диаграмма.УстановитьСерию("Отпуск");
		ТекущаяСерия.Текст = "Отпуск";

	    // Получение значения и добавление интервала
	    Значение = Диаграмма.ПолучитьЗначение(ТекущаяТочка, ТекущаяСерия);
	    Интервал = Значение.Добавить();
	    Интервал.Начало = Строка.ДатаНачала;
	    Интервал.Конец = Строка.ДатаОкончания;
	КонецЦикла;	    
	
	Диаграмма.Обновление = Истина;	
КонецПроцедуры   
# КонецОбласти
