#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	СформироватьДвижения();    
	
	РассчитатьОсновныеНачисления(); 
	
	//@skip-check undefined-variable
	Удержания.Загрузить(ВКМ_РасчетЗарплаты.РассчитатьУдержание(Движения.ВКМ_Удержания, Движения.ВКМ_ВзаиморасчетыССотрудниками, "ВКМ_ОсновныеНачисления", Ссылка, Дата));
	
КонецПроцедуры
# КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура СформироватьДвижения()       
	ПериодРегистрации = НачалоМесяца(Дата);
	
	БазовыйПериодНачало = ДобавитьМесяц(ПериодРегистрации, -12);
	БазовыйПериодКонец  = ПериодРегистрации - 1;
	
	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
	Для Каждого Строка Из ОсновныеНачисления Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Строка);
		Движение.ПериодРегистрации = ПериодРегистрации;
		Движение.ПериодДействияНачало = Строка.ДатаНачала;
		Движение.ПериодДействияКонец = КонецДня(Строка.ДатаОкончания);
		
		Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
			Движение.БазовыйПериодНачало = БазовыйПериодНачало;
			Движение.БазовыйПериодКонец  = БазовыйПериодКонец;
		КонецЕсли;
	КонецЦикла;                                                       
	Движения.ВКМ_ОсновныеНачисления.Записать();
КонецПроцедуры

Процедура РассчитатьОсновныеНачисления()   
    Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
    Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записать();
	
	//Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
    Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ОсновныеНачисления;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сотрудник", "Сотрудник");
	//@skip-check lock-out-of-try
	Блокировка.Заблокировать();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
		|	ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник,
		|	ОсновныеНачисленияДанныеГрафика.ВидРасчета КАК ВидРасчета,
		|	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия, 0) КАК ДнейВПериоде,
		|	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК ДнейОтработано,
		|	РАЗНОСТЬДАТ(ОсновныеНачисленияДанныеГрафика.ПериодДействияНачало, ОсновныеНачисленияДанныеГрафика.ПериодДействияКонец, ДЕНЬ) + 1 КАК КалендарныхДней
		|ПОМЕСТИТЬ ДанныеГрафика
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
		|			Регистратор = &Ссылка
		|				И ВидРасчета В (&ВидыРасчета)) КАК ОсновныеНачисленияДанныеГрафика
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеГрафика.НомерСтроки КАК НомерСтроки,
		|	ДанныеГрафика.Сотрудник КАК Сотрудник,
		|	ДанныеГрафика.ВидРасчета КАК ВидРасчета,
		|	ДанныеГрафика.ДнейОтработано КАК ДнейОтработано,
		|	ДанныеГрафика.ДнейВПериоде КАК ДнейВПериоде,
		|	ДанныеГрафика.КалендарныхДней КАК КалендарныхДней,
		|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад, 0) КАК Оклад
		|ПОМЕСТИТЬ РасчетОклада
		|ИЗ
		|	ДанныеГрафика КАК ДанныеГрафика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
		|				&Период,
		|				Сотрудник В
		|					(ВЫБРАТЬ
		|						ДанныеГрафика.Сотрудник
		|					ИЗ
		|						ДанныеГрафика КАК ДанныеГрафика)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|		ПО ДанныеГрафика.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетОклада.НомерСтроки КАК НомерСтроки,
		|	РасчетОклада.Сотрудник КАК Сотрудник,
		|	РасчетОклада.ВидРасчета КАК ВидРасчета,
		|	РасчетОклада.ДнейОтработано КАК ДнейОтработано,
		|	РасчетОклада.ДнейВПериоде КАК ДнейВПериоде,
		|	РасчетОклада.Оклад КАК Оклад,
		|	ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОстатки.СуммаКОплатеОстаток, 0) КАК СуммаКОплате,
		|	ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОстатки.ЧасовКОплатеОстаток, 0) КАК ЧасовКОплате,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.РезультатБаза, 0) КАК РезультатБаза,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ДнейОтработаноБаза, 0) КАК ДнейОтработаноБаза,
		|	РасчетОклада.КалендарныхДней КАК КалендарныхДней
		|ИЗ
		|	РасчетОклада КАК РасчетОклада
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Остатки(
		|				КОНЕЦПЕРИОДА(&Период, МЕСЯЦ),
		|				Сотрудник В
		|					(ВЫБРАТЬ
		|						ДанныеГрафика.Сотрудник
		|					ИЗ
		|						ДанныеГрафика КАК ДанныеГрафика)) КАК ВКМ_ВыполненныеСотрудникомРаботыОстатки
		|		ПО РасчетОклада.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОстатки.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(&Измерения, &Измерения, , Регистратор = &Ссылка) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления
		|		ПО РасчетОклада.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.НомерСтроки";
	
	ВидыРасчета = Новый Массив;
	ВидыРасчета.Добавить(ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	ВидыРасчета.Добавить(ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Сдельная);
	ВидыРасчета.Добавить(ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);          
	
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	
	Запрос.УстановитьПараметр("ВидыРасчета", ВидыРасчета);
	Запрос.УстановитьПараметр("Измерения", Измерения);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Для Каждого Движение Из Движения.ВКМ_ОсновныеНачисления Цикл    
		Выборка.Сбросить();
		Если Выборка.НайтиСледующий(Движение.НомерСтроки, "НомерСтроки") Тогда 
			
			Если Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
				Движение.Результат = ?(Выборка.ДнейВПериоде = 0, 0, Выборка.Оклад / Выборка.ДнейВПериоде * Выборка.ДнейОтработано);
				ЗаполнитьЗначенияСвойств(Движение, Выборка);   
			КонецЕсли;	
					
			Если Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Сдельная Тогда
				Движение.Результат = Выборка.СуммаКОплате;
				ЗаполнитьЗначенияСвойств(Движение, Выборка);     
				Движение.ДнейОтработано = 0;
				
				Если Выборка.СуммаКОплате <> 0 И Выборка.ЧасовКОплате <> 0 Тогда 
					ДвижениеПоСотруднику = Движения.ВКМ_ВыполненныеСотрудникомРаботы.ДобавитьРасход();
					ЗаполнитьЗначенияСвойств(ДвижениеПоСотруднику, Выборка);
					ДвижениеПоСотруднику.Период = Дата;    
				КонецЕсли;	
			КонецЕсли;	   
			
			Если Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда  
				Движение.Результат = ?(Выборка.ДнейОтработаноБаза = 0, 0,Выборка.РезультатБаза / Выборка.ДнейОтработаноБаза * Выборка.КалендарныхДней);
 				ЗаполнитьЗначенияСвойств(Движение, Выборка);  
				Движение.БазаДляОтпуска = Выборка.РезультатБаза;
				Движение.ДнейЗаБазовыйПериод = Выборка.ДнейОтработаноБаза;
           КонецЕсли;
				
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Сотрудник", Выборка.Сотрудник);
			СтруктураОтбора.Вставить("ВидРасчета", Выборка.ВидРасчета);

			МассивСтрок = ОсновныеНачисления.НайтиСтроки(СтруктураОтбора);    
			МассивСтрок[0].Результат = Движение.Результат; 
		КонецЕсли;
		
		Если Движение.Результат <> 0 Тогда       
			//@skip-check undefined-variable
			ВКМ_РасчетЗарплаты.ЗаписьПоВыплатам(Движения.ВКМ_ВзаиморасчетыССотрудниками, Истина, Дата, Выборка.Сотрудник, Движение.Результат);
		КонецЕсли;	
		
	КонецЦикла;	  

	Движения.ВКМ_ОсновныеНачисления.Записать();
    Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записать();   
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
КонецПроцедуры	
# КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

