#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДатаС КАК ВКМ_ДатаС,
		|	ДоговорыКонтрагентов.ВКМ_ДатаПо КАК ВКМ_ДатаПо,
		|	ДоговорыКонтрагентов.ВКМ_АбонентскаяПлата КАК ВКМ_АбонентскаяПлата,
		|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРабот КАК ВКМ_СтоимостьЧасаРабот
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(); 
	Выборка.Следующий();

	Если Выборка.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.АбоненскоеОбслуживание") Тогда      
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Договор не является абонентским!";
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;	 
	
	Если Выборка.ВКМ_ДатаС > Дата ИЛИ Дата > Выборка.ВКМ_ДатаПо Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Другой период договора!";
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Сотрудник", Специалист);
	
	Если РегистрыСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(Дата, Отбор).Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указан Процент от работ для сотрудника!";
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	ПроцентНачисления = РегистрыСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(Дата, Отбор).Получить(0).ПроцентОтРабот;

	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;  
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	ВыставленноЧасов = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");     
	Ставка = Выборка.ВКМ_СтоимостьЧасаРабот;
	
	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.Договор = Договор;
	Движение.КоличествоЧасов = ВыставленноЧасов;
	Движение.СуммаКОплате = ВыставленноЧасов * Ставка;

	ДвижениеПоСотруднику = Движения.ВКМ_ВыполненныеСотрудникомРаботы.ДобавитьПриход();
	ДвижениеПоСотруднику.Период = Дата;
	ДвижениеПоСотруднику.Сотрудник = Специалист;
	ДвижениеПоСотруднику.ЧасовКОплате = ВыставленноЧасов;
	ДвижениеПоСотруднику.СуммаКОплате = ВыставленноЧасов * Ставка / 100 * ПроцентНачисления; 	
	
	Движения.Записать();
	
КонецПроцедуры

# КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
