#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВКМ_ДатыОтпусков.Записывать = Истина;
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл      
		
		ТекДеньОтпуска = Строка.ДатаНачала;
		
		Пока ТекДеньОтпуска <= Строка.ДатаОкончания Цикл
			Движение = Движения.ВКМ_ДатыОтпусков.Добавить();  
			Движение.Период = ТекДеньОтпуска;
			Движение.Сотрудник = Строка.Сотрудник;
			Движение.День = 1;  
			
			ТекДеньОтпуска = ТекДеньОтпуска + (60 * 60 * 24);
		КонецЦикла;	
		
		
	КонецЦикла;	                           
	
	Движения.ВКМ_ДатыОтпусков.Записать();
	
КонецПроцедуры
#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
