
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)    
	ДатаДок = Объект.ДатаПроведенияРабот;
	СпециалистДок = Объект.Специалист;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Сообщение = "";
	
	Если Параметры.Ключ.пустая() Тогда   
		Сообщение = СтрШаблон("Создан документ от %1. Дата работ %2. Специалист %3", Элементы.Дата.ТекстРедактирования, 
							Элементы.ДатаПроведенияРабот.ТекстРедактирования, Элементы.Специалист.ТекстРедактирования); 
	Иначе						
		Если ДатаДок <> Объект.ДатаПроведенияРабот Тогда
			Сообщение = СтрШаблон("В документе %1 изменена дата проведения работ с %2 на %3", Строка(Объект.Ссылка), ДатаДок, Объект.ДатаПроведенияРабот);
		КонецЕсли;	
		
		Если СпециалистДок <> Объект.Специалист Тогда
			Сообщение = СтрШаблон("В документе %1 изменен специалист с %2 на %3", Строка(Объект.Ссылка), СпециалистДок, Объект.Специалист);
		КонецЕсли;	  
	КонецЕсли;
	
	Если Сообщение <> "" Тогда      
		ЗаписатьСообщениеБоту(Сообщение);
	КонецЕсли;	
	
КонецПроцедуры   
# КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
# КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);  
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСообщениеБоту(Сообщение)   
	ВКМ_УправлениеТелеграммБотом.ЗаписьСообщения(Сообщение);
КонецПроцедуры	 
# КонецОбласти

