
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Элементы.ПериодНадпись.Заголовок = Формат(Объект.Период, "ДФ=MMММ.yyyy");
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьАкты(Команда)     
	ДлительнаяОперация = ВыполнитьДлительныйКодНаСервере();      
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект); 
	ПараметрыОжидания.Интервал = 1; 
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;   
	ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ПрогрессВыполнения", ЭтотОбъект);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);      
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);  
КонецПроцедуры

# КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьНаСервере()      
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор КАК Договор,
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Клиент КАК Клиент
		|ПОМЕСТИТЬ ВыполненоРабот
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Договор,
		|	Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыполненоРабот.Договор КАК Договор,
		|	ВыполненоРабот.Клиент КАК Клиент,
		|	ВКМ_ПродажиПоАктамОбороты.Регистратор КАК Реализация
		|ИЗ
		|	ВыполненоРабот КАК ВыполненоРабот
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ПродажиПоАктам.Обороты(
		|				&НачалоПериода,
		|				&КонецПериода,
		|				Регистратор,
		|				(Контрагент, Договор) В
		|					(ВЫБРАТЬ
		|						Работы.Клиент,
		|						Работы.Договор
		|					ИЗ
		|						ВыполненоРабот КАК Работы)) КАК ВКМ_ПродажиПоАктамОбороты
		|		ПО ВыполненоРабот.Клиент = ВКМ_ПродажиПоАктамОбороты.Контрагент
		|			И ВыполненоРабот.Договор = ВКМ_ПродажиПоАктамОбороты.Договор
		|
		|УПОРЯДОЧИТЬ ПО
		|	Клиент,
		|	Договор,
		|	ВКМ_ПродажиПоАктамОбороты.Регистратор.Дата";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.Период));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.Период));

	Объект.СписокРеализаций.Очистить();
	
	Объект.СписокРеализаций.Загрузить(Запрос.Выполнить().Выгрузить());

	
КонецПроцедуры

&НаСервере
Функция ВыполнитьДлительныйКодНаСервере() 
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, "Обработки.ВКМ_МассовоеСозданиеАктов.ВыполнитьСерверныйКод"                  
		, Объект.Период);   
		
	Возврат ДлительнаяОперация;	       

КонецФункции


&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда  
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = (ПолучитьИзВременногоХранилища(Результат.АдресРезультата));
		Сообщение.Сообщить();
		
	КонецЕсли;   
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры	

&НаКлиенте
Процедура ПрогрессВыполнения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Прогресс <> Неопределено Тогда 
		Состояние("Выполняется серверный код", Результат.Прогресс.Процент);
	КонецЕсли;	
	
КонецПроцедуры	    

# КонецОбласти