#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	СформироватьДвижения();    

	//@skip-check undefined-variable
	Удержания.Загрузить(ВКМ_РасчетЗарплаты.РассчитатьУдержание(Движения.ВКМ_Удержания, Движения.ВКМ_ВзаиморасчетыССотрудниками, "ВКМ_ДополнительныеНачисления", Ссылка, Дата));

КонецПроцедуры
# КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения()       

	ПериодРегистрации = НачалоМесяца(Дата);
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Для Каждого Строка Из ОсновныеНачисления Цикл
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Строка);
		Движение.ПериодРегистрации = ПериодРегистрации; 
		
		//@skip-check undefined-variable
		ВКМ_РасчетЗарплаты.ЗаписьПоВыплатам(Движения.ВКМ_ВзаиморасчетыССотрудниками, Истина, Дата, Строка.Сотрудник, Строка.Результат);
	КонецЦикла;                                                       
	Движения.ВКМ_ДополнительныеНачисления.Записать(); 
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
КонецПроцедуры
# КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
